#include <iostream>
#include <cstdlib>
using namespace std;
int main() {
	int a;
	int q;
	int w;
	int e;
	int r;
	int t;
	string z;
    string x;
    string c;
    string v;
    string b;

	cout << "Введите число" << endl;
	cin >> a;

    q = (a % 10000) / 1000;
    w = (a % 1000) / 100;
    e = (a % 100) / 10;
    r = (a % 10);
    t = a % 100;
    
    if (q == 1) {
        z = "тысяча ";
    } else {
        z = "";
    }
    
    if (w == 1) {
        x = "сто ";
    }    
    if (w == 2) {
        x = "двести ";
    }    
    if (w == 3) {
        x = "триста ";
    }    
    if (w == 4) {
        x = "четыреста ";
    }    
    if (w == 5) {
        x = "пятьсот ";
    }    
    if (w == 6) {
        x = "шестьсот ";
    }    
    if (w == 7) {
        x = "семьсот ";
    }    
    if (w == 8) {
        x = "восемьсот ";
    }    
    if (w == 9) {
        x = "девятьсот ";
    }
    
    if (e == 0) {
        v = "";
    }    
    if (e == 2) {
        c = "двадцать ";
    }    
    if (e == 3) {
        c = "тридцать ";
    }    
    if (e == 4) {
        c = "сорок ";
    }    
    if (e == 5) {
        c = "пятьдесят ";
    }    
    if (e == 6) {
        c = "шестьдесят ";
    }    
    if (e == 7) {
        c = "семьдесят ";
    }    
    if (e == 8) {
        c = "восемьдесят ";
    }    
    if (e == 9) {
        c = "девятьдесят ";
    }

    if ( e != 1) {
	    if (r == 1) {
	        v = "один ";
	        b = "котик";
	    }
	    if (r == 2) {
	        v = "два ";
	        b = "котика";
	    }
	    if (r == 3) {
	        v = "три ";
	        b = "котика";
	    }
	    if (r == 4) {
	        v = "четыре ";
	        b = "котика";
	    }
	    if (r == 5) {
	        v = "пять ";
	        b = "котиков";
	    }
	    if (r == 6) {
	        v = "шесть ";
	        b = "котиков";
	    }
	    if (r == 7) {
	        v = "семь ";
	        b = "котиков";
	    }
	    if (r == 8) {
	        v = "восемь ";
	        b = "котиков";
	    }
	    if (r == 9) {
	        v = "девять ";
	        b = "котиков";
	    }
    }
    
    if (t == 11) {
        c = "одиннадцать ";
        b = "котиков";
    }
    if (t == 12) {
        c = "двеннадцать ";
        b = "котиков";
    }
    if (t == 13) {
        c = "тринадцать ";
        b = "котиков";
    }
    if (t == 14) {
        c = "четырнадцать ";
        b = "котиков";
    }
    if (t == 15) {
        c = "пятнадцать ";
       	b = "котиков";
    }
    if (t == 16) {
        c = "шестнадцать ";
        b = "котиков";
    }
    if (t == 17) {
        c = "семнадцать ";
        b = "котиков";
    }
    if (t == 18) {
        c = "восемнадцать ";
        b = "котиков";
    }
    if (t == 19) {
        c = "девятнадцать ";
        b = "котиков";
    }
    
    cout << z + x + c + v + b << endl;
	return 0;
}