#include <iostream>
#include <cstdlib>
using namespace std;
int main() {
	int a;
	char r;	

	cout << "Введите группу крови (1,2,3,4)" << endl;
	cin >> a;
	cout << "Введите резус-фактор (+,-)" << endl;
	cin >> r;

	switch (a) {
		case '1': {
			if (r == '+') {
				cout << "Вам подойдут как 1-ая положительная, так и 1-ая отрицательная.";
			}
			else if (r == '-') {
				cout << "Вам подойдёт 1-ая отрицательная.";
			}
			break;
		}	
		case '2': {
			if (r == '+') {
				cout << "Вам подойдут: ";
				cout << "1-ая отрицательная и положительная;";
				cout << "2-ая отрицательная и положительная;";
			}
			else if (r == '-') {
				cout << "Вам подойдёт 1-ая отрицательная и 2-ая отрицательная.";
			}
			break;
		}
		case '3': {
			if (r == '+') {
				cout << "Вам подойдут: ";
				cout << "1-ая отрицательная и положительная;";
				cout << "3-я отрицательная и положительная;";
			}
			else if (r == '-') {
				cout << "Вам подойдёт 1-ая отрицательная и 3-я отрицательная.";
			}
			break;
		}
		case '4': {
			if (r == '+') {
				cout << "Вам подойдёт любая другая группа крови. ";
			}
			else if (r == '-') {
				cout << "Вам подойдут: ";
				cout << "1-ая отрицательная;";
				cout << "2-ая отрицательная;";
				cout << "3-я отрицательная;";
				cout << "4-ая отрицательная;";
			}
			break;
		}
		default: {
			cout << "Проверьте ввод данных" << endl;
			break;
		}
	}	
	system("pause");
	return 0;
}